---
kind: property
id: P:Autodesk.Revit.DB.TableMergedCell.Right
source: html/45978c38-7c1d-f239-8e87-0f1084ca7394.htm
---
# Autodesk.Revit.DB.TableMergedCell.Right Property

Specifies the column index of the bottom-right corner of a table grid.

## Syntax (C#)
```csharp
public int Right { get; set; }
```